#include <bits/stdc++.h>
using namespace std;
int main()
{
    string sentence;
    getline(cin, sentence); // স্পেস সহ একটি পুরো সেন্টেন্স ইনপুট নেওয়া হচ্ছে।
    string word;
    stringstream ss(sentence); // স্ট্রিংস্ট্রিম দিয়ে প্রতিটি ওয়ার্ড আলাদা করা হচ্ছে।
    map<string, int> mp;       // একটি ম্যাপ নেওয়া হচ্ছে। যার কি হিসেবে নেওয়া হয়েছে স্ট্রিং এবং ভেলু হিসেবে নেওয়া হয়েছে ইন্টিজার।
    while (ss >> word)         // একটি করে ওয়ার্ড এনে
    {
        mp[word]++; // ম্যাপে ইনসার্ট করে তার ভেলু ১ বাড়িয়ে দেওয়া হচ্ছে।
    }
    for (auto it = mp.begin(); it != mp.end(); it++) // লুপ চালিয়ে ম্যাপ প্রিন্ট করা হচ্ছে।
    {
        cout << it->first << " " << it->second << endl; // যেহেতু ম্যাপ একটি কি ভেলু পেয়ার তাই পেয়ার হিসেবে প্রিন্ট করা হচ্ছে। প্রথম ভেলুটি হচ্ছে আমাদের ওয়ার্ড দ্বিতীয় ভেলুটি হচ্ছে সেই ওয়ার্ডটি কতবার এসেছে।
    }

    return 0;
}